src_doc/InformationRegisters/СостоянияФоновыхЗаданийПриемкиВнутреннейМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияФоновыхЗаданийПриемкиВнутреннейМаршрутизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПорядокДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокДоставкиПисемПоВнутреннейМаршрутизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/СостоянияФоновыхЗаданийПриемкиВнутреннейМаршрутизации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает статус потока
Процедура ЗаписатьСтатус(ПорядокДоставки, Поток, ДатаНачала, ДатаПоследнейАктивности,
	Описание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.СостоянияФоновыхЗаданийПриемкиВнутреннейМаршрутизации.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Поток = Поток;
	МенеджерЗаписи.ПорядокДоставки = ПорядокДоставки;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Поток = Поток;
	МенеджерЗаписи.ПорядокДоставки = ПорядокДоставки;
	
	Если ДатаНачала <> Неопределено Тогда
		МенеджерЗаписи.ДатаНачала = ДатаНачала;
	КонецЕсли;	
	МенеджерЗаписи.ДатаПоследнейАктивности = ДатаПоследнейАктивности;
	МенеджерЗаписи.Описание = Описание;
	МенеджерЗаписи.НомерСеанса = НомерСеансаИнформационнойБазы();
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
